Data frame
mubable
indexed based
class with methods and properties

Loading json file using base Python json library

In [1]:
import json

with open("example-1.json", mode="rt", encoding="utf-8") as f:
    data = json.load(f)

# last line in notebook call will be rendered
data

[{'Column 1': 1, 'Column 2': 2},
 {'Column 1': 3, 'Column 2': 4},
 {'Column 1': 5, 'Column 2': 6}]

Loading csv file using base Python csv library

In [2]:
import csv

with open("example-1.csv", mode="rt", encoding="utf-8") as f:
    csv_reader = csv.DictReader(f)
    for row in csv_reader:
        print(row)

{'Branch': 'Branch A', 'Date': 'January 1', 'Amount': '500.00'}
{'Branch': 'Branch B', 'Date': 'January 2', 'Amount': '250.00'}
{'Branch': 'Branch A', 'Date': 'January 3', 'Amount': '300.00'}

Start using pandas
first import the module

In [3]:
import pandas as pd

C:\Users\Pepo\AppData\Local\Temp\ipykernel_18540\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

create empty DataFrame object with 2 labeled columns

In [4]:
df_one = pd.DataFrame(columns=["Column 1", "Column 2"])

df_one

Empty DataFrame
Columns: [Column 1, Column 2]
Index: []

Rename columns in df_one by changing property columns

In [5]:
df_one.columns = ["First", "Second"]

df_one

Empty DataFrame
Columns: [First, Second]
Index: []

Creating dataframe with default data
Below data frame is indexed as each row gets its own number, so we can access later each row by this index

In [6]:
new_data = {
    "First": [1, 2, "foo"],
    "Second": [3, 4, "bar"],
}

df_two = pd.DataFrame(new_data)

df_two

  First Second
0     1      3
1     2      4
2   foo    bar

Adding data frames together row-wise
using concat function (similar to SQL union all)

In [7]:
df_combined = pd.concat([df_one, df_two])

df_combined

  First Second
0     1      3
1     2      4
2   foo    bar

combining 2 not empty datasets row-wise
using concat function

In [8]:
data_for_one = {
    "First": [5, 6, "Hello"],
    "Second": [7, 8, "World"],
}

df_one = pd.DataFrame(data_for_one)

df_combined = pd.concat([df_one, df_two])

df_combined

   First Second
0      5      7
1      6      8
2  Hello  World
0      1      3
1      2      4
2    foo    bar

row indexes are copied over, not unique
need to be reindexed to make it unique

In [ ]:
df_combined.reset_index(drop=True, inplace=True)

df_combined

   First Second
0      5      7
1      6      8
2  Hello  World
3      1      3
4      2      4
5    foo    bar

combining data frames column-wise
using concat function
NaN = Not a Number

In [10]:
data_for_three = {
    "Thrid": ["a", "b", "c"]
}

df_three = pd.DataFrame(data_for_three)

df_combined = pd.concat([df_combined, df_three], axis=1)

df_combined

   First Second Thrid
0      5      7     a
1      6      8     b
2  Hello  World     c
3      1      3   NaN
4      2      4   NaN
5    foo    bar   NaN